_Rarzrabotki/BASEBuh/DataProcessors/А_РозрахункиПДВЗаПершоюПодією.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>А_РозрахункиПДВЗаПершоюПодією</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГраницаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьЗакрытыйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоРасхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ключи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяТара</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляХозяйственнойДеятельности</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДеятельностиНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДеятельностиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Амортизируется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаемоПС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактПС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо6442</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументовВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументовСРасхождением</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервыйДокумент</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗакрытыйПериод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСПоступление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСОплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаемоПС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактПС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьРасхождение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗакрытыйПериод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Протокол</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БылВОчередиОбмена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СнятСОчереди</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/BASEBuh/DataProcessors/А_РозрахункиПДВЗаПершоюПодією/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	Если Параметры.Свойство("ДополнительнаяОбработкаСсылка") Тогда
		ДополнительнаяОбработкаСсылка = Параметры.ДополнительнаяОбработкаСсылка;
	КонецЕсли;

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;
	Объект.ГраницаЗапрета = ОбъектОбработки.ГраницаЗапретаИзменения();
	ТекстИнструкции = ОбъектОбработки.ПолучитьМакет("Инструкция").ПолучитьТекст();

	Связи = Новый Массив;
	Связи.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент"));
	Элементы.ДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
	Элементы.РазрешитьЗакрытыйПериод.Подсказка = СтрШаблон(
		НСтр("ru='Разрешить перепроведение документов с датой по %1 включительно (дата запрета изменений для всех пользователей). Ночные команды закрытый период не трогают никогда.';uk='Дозволити перепроведення документів з датою по %1 включно (дата заборони змін для всіх користувачів). Нічні команди закритий період не чіпають ніколи.'"),
		Формат(Объект.ГраницаЗапрета, "ДЛФ=D; ДП=—"));

	НастроитьУсловноеОформление(ОбъектОбработки);
	ОбновитьРезюме(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПрименитьОтборДокументов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	Объект.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");

КонецПроцедуры

&НаКлиенте
Процедура РазрешитьЗакрытыйПериодПриИзменении(Элемент)

	Если Объект.РазрешитьЗакрытыйПериод Тогда
		ПоказатьОповещениеПользователя(НСтр("ru='Закрытый период разрешён';uk='Закритий період дозволено'"), ,
			НСтр("ru='Документы закрытого периода можно отметить вручную.';uk='Документи закритого періоду можна відмітити вручну.'"));
		Возврат;
	КонецЕсли;
	ИзмененныеКлючи = Новый Соответствие;
	Для Каждого СтрДок Из Объект.Документы Цикл
		Если СтрДок.Отметка И СтрДок.ЗакрытыйПериод Тогда
			СтрДок.Отметка = Ложь;
			ИзмененныеКлючи.Вставить(СтрДок.КлючИД, Истина);
		КонецЕсли;
	КонецЦикла;
	Для Каждого КлючИЗначение Из ИзмененныеКлючи Цикл
		ОбновитьОтметкуКлюча(КлючИЗначение.Ключ);
	КонецЦикла;
	ОбновитьРезюме(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ТолькоРасхожденияПриИзменении(Элемент)

	ПрименитьОтборДокументов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблиц

&НаКлиенте
Процедура КлючиПриАктивизацииСтроки(Элемент)

	ПодключитьОбработчикОжидания("ПрименитьОтборДокументов", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура КлючиОтметкаПриИзменении(Элемент)

	СтрКлюч = Элементы.Ключи.ТекущиеДанные;
	Если СтрКлюч = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Хотели = СтрКлюч.Отметка;
	УстановитьОтметкуКлюча(СтрКлюч, Хотели);
	Если Хотели И НЕ СтрКлюч.Отметка Тогда
		ПоказатьПредупреждение(, НСтр("ru='У ключа нет документов, доступных для перепроведения: расхождения в закрытом периоде или уже перепроведены. Включите «Разрешить закрытый период» или отметьте документы внизу вручную.';uk='У ключа немає документів, доступних для перепроведення: розбіжності в закритому періоді або вже перепроведені. Увімкніть «Дозволити закритий період» або відмітьте документи внизу вручну.'"));
	КонецЕсли;
	ОбновитьРезюме(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура КлючиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.КлючиОтметка Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	СтрКлюч = Объект.Ключи.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрКлюч = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Поле = Элементы.КлючиОрганизация Тогда
		Значение = СтрКлюч.Организация;
	ИначеЕсли Поле = Элементы.КлючиКонтрагент Тогда
		Значение = СтрКлюч.Контрагент;
	ИначеЕсли Поле = Элементы.КлючиДоговор Тогда
		Значение = СтрКлюч.ДоговорКонтрагента;
	ИначеЕсли Поле = Элементы.КлючиСделка Тогда
		Значение = СтрКлюч.Сделка;
	Иначе
		Значение = СтрКлюч.ПервыйДокумент;
	КонецЕсли;
	Если ЗначениеЗаполнено(Значение) Тогда
		ПоказатьЗначение(, Значение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыОтметкаПриИзменении(Элемент)

	СтрДок = Элементы.Документы.ТекущиеДанные;
	Если СтрДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если СтрДок.Отметка И СтрДок.ЗакрытыйПериод И НЕ Объект.РазрешитьЗакрытыйПериод Тогда
		СтрДок.Отметка = Ложь;
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru='Документ в закрытом периоде (запрет изменений по %1). Включите «Разрешить закрытый период».';uk='Документ у закритому періоді (заборона змін по %1). Увімкніть «Дозволити закритий період».'"),
			Формат(Объект.ГраницаЗапрета, "ДЛФ=D")));
	КонецЕсли;
	ОбновитьОтметкуКлюча(СтрДок.КлючИД);
	ОбновитьРезюме(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле = Элементы.ДокументыОтметка Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	СтрДок = Объект.Документы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрДок <> Неопределено И ЗначениеЗаполнено(СтрДок.Документ) Тогда
		ПоказатьЗначение(, СтрДок.Документ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПротоколВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СтрПрот = Объект.Протокол.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрПрот <> Неопределено И ЗначениеЗаполнено(СтрПрот.Документ) Тогда
		ПоказатьЗначение(, СтрПрот.Документ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЖурналВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СтрЖурнал = Журнал.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрЖурнал <> Неопределено Тогда
		ПоказатьПредупреждение(, СтрЖурнал.Комментарий);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Анализировать(Команда)

	Итог = АнализироватьНаСервере();
	ПрименитьОтборДокументов();
	ПоказатьОповещениеПользователя(НСтр("ru='Анализ завершён';uk='Аналіз завершено'"), ,
		СтрШаблон(НСтр("ru='Ключей с расхождением: %1, документов: %2, лишний НДС 6442: %3';uk='Ключів з розбіжністю: %1, документів: %2, зайвий ПДВ 6442: %3'"),
			Итог.КлючейСРасхождением, Итог.ДокументовСРасхождением, Формат(Итог.Отклонение, "ЧДЦ=2; ЧН=0")));

КонецПроцедуры

&НаКлиенте
Процедура ПерепровестиОтмеченные(Команда)

	СписокДокументов = Новый Массив;
	КлючиСОтметками = Новый Соответствие;
	Для Каждого СтрДок Из Объект.Документы Цикл
		Если СтрДок.Отметка И СписокДокументов.Найти(СтрДок.Документ) = Неопределено Тогда
			СписокДокументов.Добавить(СтрДок.Документ);
			КлючиСОтметками.Вставить(СтрДок.КлючИД, Истина);
		КонецЕсли;
	КонецЦикла;
	Если СписокДокументов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Отметьте ключи или документы для перепроведения.';uk='Відмітьте ключі або документи для перепроведення.'"));
		Возврат;
	КонецЕсли;
	Текст = СтрШаблон(НСтр("ru='Перепровести %1 документ(ов) по %2 ключам в хронологическом порядке?
		|Документы, которых не было в очереди обмена с ЕРП, из очереди будут сняты.';uk='Перепровести %1 документ(ів) по %2 ключах у хронологічному порядку?
		|Документи, яких не було в черзі обміну з ЕРП, з черги буде знято.'"),
		СписокДокументов.Количество(), КлючиСОтметками.Количество());
	ПоказатьВопрос(Новый ОписаниеОповещения("ПерепровестиОтмеченныеЗавершение", ЭтотОбъект, СписокДокументов),
		Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеКлючи(Команда)

	УстановитьОтметкиКлючей(1);

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеКлючи(Команда)

	УстановитьОтметкиКлючей(0);

КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьКлючи(Команда)

	УстановитьОтметкиКлючей(-1);

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыделенныеДокументы(Команда)

	УстановитьОтметкиВыделенныхДокументов(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделенныеДокументы(Команда)

	УстановитьОтметкиВыделенныхДокументов(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)

	СтрДок = Элементы.Документы.ТекущиеДанные;
	Если СтрДок <> Неопределено И ЗначениеЗаполнено(СтрДок.Документ) Тогда
		ПоказатьЗначение(, СтрДок.Документ);
		Возврат;
	КонецЕсли;
	СтрКлюч = Элементы.Ключи.ТекущиеДанные;
	Если СтрКлюч <> Неопределено И ЗначениеЗаполнено(СтрКлюч.ПервыйДокумент) Тогда
		ПоказатьЗначение(, СтрКлюч.ПервыйДокумент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КарточкаСчета6442(Команда)

	СтрКлюч = Элементы.Ключи.ТекущиеДанные;
	Если СтрКлюч = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru='Выберите ключ в верхней таблице.';uk='Оберіть ключ у верхній таблиці.'"));
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Отчет.КарточкаСчета.Форма.ФормаОтчета", ПараметрыКарточкиСчета(СтрКлюч.ПолучитьИдентификатор()),
		ЭтотОбъект, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДокументыПериода(Команда)

	ПоказатьДокументыПериодаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПерепровестиПериод(Команда)

	Если Объект.Протокол.Количество() = 0 Тогда
		ПоказатьДокументыПериодаНаСервере();
	КонецЕсли;
	СписокДокументов = Новый Массив;
	Для Каждого СтрПрот Из Объект.Протокол Цикл
		Если (НЕ ЭтоЗакрытыйПериод(СтрПрот.Дата, Объект.ГраницаЗапрета) ИЛИ Объект.РазрешитьЗакрытыйПериод)
			И НЕ СтрНачинаетсяС(СтрПрот.Статус, ПрефиксУспеха()) Тогда
			СписокДокументов.Добавить(СтрПрот.Документ);
		КонецЕсли;
	КонецЦикла;
	Если СписокДокументов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='За период нет документов для перепроведения.';uk='За період немає документів для перепроведення.'"));
		Возврат;
	КонецЕсли;
	Текст = СтрШаблон(НСтр("ru='Перепровести все документы механизма НДС за %1 – %2: %3 шт. в хронологическом порядке?
		|Это может занять длительное время.';uk='Перепровести всі документи механізму ПДВ за %1 – %2: %3 шт. у хронологічному порядку?
		|Це може зайняти тривалий час.'"),
		Формат(Объект.ДатаНачала, "ДЛФ=D"), Формат(Объект.ДатаОкончания, "ДЛФ=D"), СписокДокументов.Количество());
	ПоказатьВопрос(Новый ОписаниеОповещения("ПерепровестиПериодЗавершение", ЭтотОбъект, СписокДокументов),
		Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЖурнал(Команда)

	ОбновитьЖурналНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = Новый СтандартныйПериод(Объект.ДатаНачала, Объект.ДатаОкончания);
	Диалог.Показать(Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отметки

// Режим: 1 — відмітити, 0 — зняти, -1 — інвертувати.
&НаКлиенте
Процедура УстановитьОтметкиКлючей(Режим)

	Для Каждого СтрКлюч Из Объект.Ключи Цикл
		УстановитьОтметкуКлюча(СтрКлюч, ?(Режим = -1, НЕ СтрКлюч.Отметка, Режим = 1));
	КонецЦикла;
	ОбновитьРезюме(ЭтотОбъект);

КонецПроцедуры

// Відмітка ключа → розбіжні документи ключа, доступні для перепроведення; зняття — з усіх документів ключа.
&НаКлиенте
Процедура УстановитьОтметкуКлюча(СтрКлюч, Значение)

	ЕстьОтмеченные = Ложь;
	Для Каждого СтрДок Из Объект.Документы.НайтиСтроки(Новый Структура("КлючИД", СтрКлюч.КлючИД)) Цикл
		СтрДок.Отметка = Значение И СтрДок.ЕстьРасхождение И ДокументДоступен(СтрДок);
		ЕстьОтмеченные = ЕстьОтмеченные ИЛИ СтрДок.Отметка;
	КонецЦикла;
	СтрКлюч.Отметка = ЕстьОтмеченные;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкиВыделенныхДокументов(Значение)

	ИзмененныеКлючи = Новый Соответствие;
	Для Каждого ИдСтроки Из Элементы.Документы.ВыделенныеСтроки Цикл
		СтрДок = Объект.Документы.НайтиПоИдентификатору(ИдСтроки);
		Если СтрДок = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрДок.Отметка = Значение И (НЕ СтрДок.ЗакрытыйПериод ИЛИ Объект.РазрешитьЗакрытыйПериод);
		ИзмененныеКлючи.Вставить(СтрДок.КлючИД, Истина);
	КонецЦикла;
	Для Каждого КлючИЗначение Из ИзмененныеКлючи Цикл
		ОбновитьОтметкуКлюча(КлючИЗначение.Ключ);
	КонецЦикла;
	ОбновитьРезюме(ЭтотОбъект);

КонецПроцедуры

// Відмітка ключа = «є відмічені документи ключа».
&НаКлиенте
Процедура ОбновитьОтметкуКлюча(КлючИД)

	ЕстьОтмеченные = Ложь;
	Для Каждого СтрДок Из Объект.Документы.НайтиСтроки(Новый Структура("КлючИД", КлючИД)) Цикл
		ЕстьОтмеченные = ЕстьОтмеченные ИЛИ СтрДок.Отметка;
	КонецЦикла;
	Для Каждого СтрКлюч Из Объект.Ключи.НайтиСтроки(Новый Структура("КлючИД", КлючИД)) Цикл
		СтрКлюч.Отметка = ЕстьОтмеченные;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ДокументДоступен(СтрДок)

	Возврат (НЕ СтрДок.ЗакрытыйПериод ИЛИ Объект.РазрешитьЗакрытыйПериод)
		И НЕ СтрНачинаетсяС(СтрДок.Статус, ПрефиксУспеха());

КонецФункции

&НаКлиенте
Процедура ПрименитьОтборДокументов()

	СтрКлюч = Элементы.Ключи.ТекущиеДанные;
	Если СтрКлюч = Неопределено Тогда
		Элементы.Документы.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючИД", "-"));
		Возврат;
	КонецЕсли;
	Отбор = Новый Структура("КлючИД", СтрКлюч.КлючИД);
	Если Объект.ТолькоРасхождения Тогда
		Отбор.Вставить("ЕстьРасхождение", Истина);
	КонецЕсли;
	Элементы.Документы.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);

КонецПроцедуры

#КонецОбласти

#Область Перепроведение

&НаКлиенте
Процедура ПерепровестиОтмеченныеЗавершение(Ответ, СписокДокументов) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗапуститьПерепроведение(СписокДокументов, "Ключи");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПерепровестиПериодЗавершение(Ответ, СписокДокументов) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗапуститьПерепроведение(СписокДокументов, "Период");
	КонецЕсли;

КонецПроцедуры

// Фон — через команду «ФонПерепровести» зареєстрованої обробки БСП (зовнішня обробка з «Файл → Відкрити»
// у фон не йде — тоді синхронно на сервері).
&НаКлиенте
Процедура ЗапуститьПерепроведение(СписокДокументов, Режим)

	Если НЕ ЗначениеЗаполнено(ДополнительнаяОбработкаСсылка) Тогда
		Итог = ПерепровестиНаСервере(СписокДокументов, Режим);
		ПослеПерепроведенияНаКлиенте(Итог, Режим);
		Возврат;
	КонецЕсли;
	ПараметрыКоманды = ДополнительныеОтчетыИОбработкиКлиент.ПараметрыВыполненияКомандыВФоне(ДополнительнаяОбработкаСсылка);
	ПараметрыКоманды.Вставить("ИдентификаторКоманды", "ФонПерепровести");
	ПараметрыКоманды.Вставить("Документы", СписокДокументов);
	ПараметрыКоманды.Вставить("РазрешитьЗакрытыйПериод", Объект.РазрешитьЗакрытыйПериод);
	Задание = ДополнительныеОтчетыИОбработкиВызовСервера.ЗапуститьДлительнуюОперацию(УникальныйИдентификатор, ПараметрыКоманды);

	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ТекстСообщения = СтрШаблон(НСтр("ru='Перепроведение %1 документ(ов)…';uk='Перепроведення %1 документ(ів)…'"),
		СписокДокументов.Количество());
	НастройкиОжидания.ВыводитьОкноОжидания = Истина;
	НастройкиОжидания.ВыводитьПрогрессВыполнения = Истина;
	НастройкиОжидания.ВыводитьСообщения = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Задание,
		Новый ОписаниеОповещения("ПерепроведениеВФонеЗавершение", ЭтотОбъект, Режим), НастройкиОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ПерепроведениеВФонеЗавершение(Результат, Режим) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Результат.Статус <> "Выполнено" Тогда
		ПоказатьПредупреждение(, НСтр("ru='Перепроведение завершилось ошибкой: ';uk='Перепроведення завершилось помилкою: '")
			+ Результат.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	Итог = ПрименитьРезультатФонаНаСервере(Результат.АдресРезультата, Режим);
	ПослеПерепроведенияНаКлиенте(Итог, Режим);

КонецПроцедуры

&НаКлиенте
Процедура ПослеПерепроведенияНаКлиенте(Итог, Режим)

	ПрименитьОтборДокументов();
	Текст = СтрШаблон(НСтр("ru='Перепроведено: %1, ошибок: %2, пропущено: %3, снято с очереди обмена ЕРП: %4';uk='Перепроведено: %1, помилок: %2, пропущено: %3, знято з черги обміну ЕРП: %4'"),
		Итог.Перепроведено, Итог.Ошибок, Итог.Пропущено, Итог.СнятоСОчереди);
	Если Режим = "Ключи" Тогда
		Текст = Текст + Символы.ПС + СтрШаблон(НСтр("ru='Осталось ключей с расхождением: %1 (лишний НДС 6442: %2).';uk='Лишилось ключів з розбіжністю: %1 (зайвий ПДВ 6442: %2).'"),
			Итог.КлючейСРасхождением, Формат(Итог.Отклонение, "ЧДЦ=2; ЧН=0"));
	КонецЕсли;
	ПоказатьПредупреждение(, Текст);

КонецПроцедуры

&НаСервере
Функция ПерепровестиНаСервере(Знач СписокДокументов, Знач Режим)

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Протокол = ОбъектОбработки.ПерепровестиДокументы(СписокДокументов);
	Возврат ПрименитьПротокол(ОбъектОбработки, Протокол, Режим);

КонецФункции

&НаСервере
Функция ПрименитьРезультатФонаНаСервере(Знач Адрес, Знач Режим)

	РезультатВыполнения = ПолучитьИзВременногоХранилища(Адрес);
	Протокол = РезультатВыполнения.Итог;
	Возврат ПрименитьПротокол(РеквизитФормыВЗначение("Объект"), Протокол, Режим);

КонецФункции

&НаСервере
Функция ПрименитьПротокол(ОбъектОбработки, Протокол, Режим)

	Если Режим = "Ключи" Тогда
		Итог = ОбъектОбработки.ПослеПерепроведения(Протокол);
	Иначе
		ОбъектОбработки.ПрименитьПротоколПериода(Протокол);
		Итог = Новый Структура("Перепроведено, Ошибок, Пропущено, СнятоСОчереди", 0, 0, 0, 0);
		Для Каждого СтрПрот Из Протокол Цикл
			Если СтрПрот.Успех Тогда
				Итог.Перепроведено = Итог.Перепроведено + 1;
			ИначеЕсли СтрНачинаетсяС(СтрПрот.Статус, ОбъектОбработки.ПрефиксОшибки()) Тогда
				Итог.Ошибок = Итог.Ошибок + 1;
			Иначе
				Итог.Пропущено = Итог.Пропущено + 1;
			КонецЕсли;
			Если СтрПрот.СнятСОчереди Тогда
				Итог.СнятоСОчереди = Итог.СнятоСОчереди + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");
	ОбновитьРезюме(ЭтотОбъект);
	Возврат Итог;

КонецФункции

#КонецОбласти

&НаСервере
Функция АнализироватьНаСервере()

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Итог = ОбъектОбработки.Анализировать();
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");
	ОбновитьРезюме(ЭтотОбъект);
	Возврат Итог;

КонецФункции

&НаСервере
Процедура ПоказатьДокументыПериодаНаСервере()

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Итог = ОбъектОбработки.ЗаполнитьПротоколПериода();
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");
	Части = Новый Массив;
	Для Каждого КлючИЗначение Из Итог.ПоВидам Цикл
		Части.Добавить(КлючИЗначение.Ключ + ": " + КлючИЗначение.Значение);
	КонецЦикла;
	НадписьПериод = СтрШаблон(НСтр("ru='Документов механизма НДС за %1 – %2: %3 (в закрытом периоде: %4). %5';uk='Документів механізму ПДВ за %1 – %2: %3 (у закритому періоді: %4). %5'"),
		Формат(Объект.ДатаНачала, "ДЛФ=D"), Формат(Объект.ДатаОкончания, "ДЛФ=D"), Итог.Всего, Итог.ВЗакрытомПериоде,
		СтрСоединить(Части, "; "));

КонецПроцедуры

&НаСервере
Процедура ОбновитьЖурналНаСервере()

	Журнал.Загрузить(РеквизитФормыВЗначение("Объект").ПрочитатьЖурнал());

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт

	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.ДатаНачала = Период.ДатаНачала;
	Объект.ДатаОкончания = Период.ДатаОкончания;

КонецПроцедуры

// Картка рахунку 6442 з відбором по ключу (механіка БухгалтерскиеОтчетыВызовСервера.ПриСозданииНаСервере, ВидРасшифровки = 2).
&НаСервере
Функция ПараметрыКарточкиСчета(Знач ИдСтроки)

	СтрКлюч = Объект.Ключи.НайтиПоИдентификатору(ИдСтроки);
	Настройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	Настройки.ДополнительныеСвойства.Вставить("Счет", ПланыСчетов.Хозрасчетный.НалоговыйКредитНеподтвержденный);
	Настройки.ДополнительныеСвойства.Вставить("НачалоПериода", НачалоДня(Объект.ДатаНачала));
	Настройки.ДополнительныеСвойства.Вставить("КонецПериода", КонецДня(Объект.ДатаОкончания));
	Настройки.ДополнительныеСвойства.Вставить("Организация", СтрКлюч.Организация);
	Отбор = Настройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	Отбор.ИдентификаторПользовательскойНастройки = "Отбор";
	ДобавитьОтборКарточки(Отбор, "Субконто1", СтрКлюч.Контрагент);
	ДобавитьОтборКарточки(Отбор, "Субконто2", СтрКлюч.ДоговорКонтрагента);
	Если ЗначениеЗаполнено(СтрКлюч.Сделка) Тогда
		ДобавитьОтборКарточки(Отбор, "Субконто3", СтрКлюч.Сделка);
	КонецЕсли;
	Возврат Новый Структура("ВидРасшифровки, ПользовательскиеНастройки, СформироватьПриОткрытии", 2, Настройки, Истина);

КонецФункции

&НаСервере
Процедура ДобавитьОтборКарточки(Отбор, ИмяПоля, Значение)

	ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Значение;
	ЭлементОтбора.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура НастроитьУсловноеОформление(ОбъектОбработки)

	Успех = ОбъектОбработки.ПрефиксУспеха();
	Ошибка = ОбъектОбработки.ПрефиксОшибки();
	Жирный = Новый Шрифт(, , , Истина);
	НачинаетсяС = ВидСравненияКомпоновкиДанных.НачинаетсяС;
	Равно = ВидСравненияКомпоновкиДанных.Равно;

	ДобавитьОформление("Ключи", "Объект.Ключи.Отметка", Равно, Ложь, "ЦветТекста", WebЦвета.Серый);
	ДобавитьОформление("Ключи", "Объект.Ключи.ЗакрытыйПериод", Равно, Истина, "ЦветФона", WebЦвета.ДымчатоБелый);
	ДобавитьОформление("Ключи", "Объект.Ключи.Статус", Равно, ОбъектОбработки.СтатусИсправлено(), "ЦветТекста", WebЦвета.ЗеленыйЛес);
	ДобавитьОформление("Ключи", "Объект.Ключи.Статус", НачинаетсяС, НСтр("ru='Осталось';uk='Лишилась'"), "ЦветТекста", WebЦвета.Красный);

	ДобавитьОформление("Документы", "Объект.Документы.Отметка", Равно, Ложь, "ЦветТекста", WebЦвета.Серый);
	ДобавитьОформление("Документы", "Объект.Документы.ЗакрытыйПериод", Равно, Истина, "ЦветФона", WebЦвета.ДымчатоБелый);
	ДобавитьОформление("Документы", "Объект.Документы.ЕстьРасхождение", Равно, Истина, "Шрифт", Жирный);
	ДобавитьОформление("Документы", "Объект.Документы.Статус", НачинаетсяС, Успех, "ЦветТекста", WebЦвета.ЗеленыйЛес);
	ДобавитьОформление("Документы", "Объект.Документы.Статус", НачинаетсяС, Ошибка, "ЦветТекста", WebЦвета.Красный);

	ДобавитьОформление("Протокол", "Объект.Протокол.Статус", НачинаетсяС, Успех, "ЦветТекста", WebЦвета.ЗеленыйЛес);
	ДобавитьОформление("Протокол", "Объект.Протокол.Статус", НачинаетсяС, Ошибка, "ЦветТекста", WebЦвета.Красный);

КонецПроцедуры

&НаСервере
Процедура ДобавитьОформление(ИмяТаблицы, ПутьПоля, ВидСравнения, Значение, ИмяПараметра, ЗначениеПараметра)

	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы);
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьПоля);
	ЭлементОтбора.ВидСравнения = ВидСравнения;
	ЭлементОтбора.ПравоеЗначение = Значение;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоЗакрытыйПериод(ДатаДокумента, ГраницаЗапрета)

	Возврат ЗначениеЗаполнено(ГраницаЗапрета) И ДатаДокумента <= КонецДня(ГраницаЗапрета);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПрефиксУспеха()

	Возврат НСтр("ru='Перепроведено';uk='Перепроведено'");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьРезюме(Форма)

	Исправлено = НСтр("ru='Исправлено';uk='Виправлено'");
	КлючейСРасхождением = 0;
	ДокументовСРасхождением = 0;
	Лишнее = 0;
	КлючейОтмечено = 0;
	Для Каждого СтрКлюч Из Форма.Объект.Ключи Цикл
		Если СтрКлюч.Статус = Исправлено Тогда
			Продолжить;
		КонецЕсли;
		КлючейСРасхождением = КлючейСРасхождением + 1;
		ДокументовСРасхождением = ДокументовСРасхождением + СтрКлюч.ДокументовСРасхождением;
		Лишнее = Лишнее + СтрКлюч.Отклонение;
		Если СтрКлюч.Отметка Тогда
			КлючейОтмечено = КлючейОтмечено + 1;
		КонецЕсли;
	КонецЦикла;
	ДокументовОтмечено = 0;
	Для Каждого СтрДок Из Форма.Объект.Документы Цикл
		Если СтрДок.Отметка Тогда
			ДокументовОтмечено = ДокументовОтмечено + 1;
		КонецЕсли;
	КонецЦикла;
	Форма.НадписьРезюме = СтрШаблон(НСтр("ru='Ключей с расхождением: %1 · документов с расхождением: %2 · лишний НДС 6442: %3 грн · отмечено: ключей %4, документов %5 · запрет изменений по %6';uk='Ключів з розбіжністю: %1 · документів з розбіжністю: %2 · зайвий ПДВ 6442: %3 грн · відмічено: ключів %4, документів %5 · заборона змін по %6'"),
		КлючейСРасхождением, ДокументовСРасхождением, Формат(Лишнее, "ЧДЦ=2; ЧН=0"), КлючейОтмечено, ДокументовОтмечено,
		Формат(Форма.Объект.ГраницаЗапрета, "ДЛФ=D; ДП=—"));

КонецПроцедуры

#КонецОбласти
